'=============================GIT============================'
# Это распределенная система контроля версий (это система записывающая изминения в файл или набор файлов в течении времени)Предназначен для отслеживания и ведения истории файлов,в вашем проекте

'==========================GITHUB==================='
#Это сайт куда я могу отправить все что на моем ноутбуке чтобы другие люди могли просматривать мой код и мой прогресс и просматривать его


'репизиторий'
#хранилище проекта
#1.локальный (на ноутбуке)
#2.удаленный(на каком-то сервиmсе,который предоставляет репозиторий (GITHUB))
